<template>
  <v-app class="main-view">
    <v-main class="main-view__container pt-4">
      <v-container class="fluid-container" fluid>
        <div class="content-main pt-0 mb-16">
          <v-main>
            <v-row class="d-flex justify-center">
              <v-col class="d-flex flex-column justify-center align-center">
                <div class="px-3 doc-page d-flex flex-column mt-6 font-16">
                  <p class="text-center">
                    <strong>СОГЛАШЕНИЕ (ОФЕРТА)</strong> <br>
                    с условиями подписки
                  </p>
                  <p>
                    Данный документ является официальным предложением (публичной офертой) Администрации сайта, которое адресовано неограниченному кругу лиц.
                  </p>
                  <p>
                    Внимательно ознакомьтесь с текстом настоящей оферты, если Вы не согласны с каким-либо ее пунктом, Вам предлагается воздержаться от каких-либо действий необходимых для ее акцепта.
                  </p>
                  <p>
                    В соответствии с ч.3 ст.438 Гражданского Кодекса Российской Федерации соглашение (договор) считается заключенным на условиях настоящей оферты с момента ее акцептирования.
                  </p>
                  <p class="text-center">
                    <strong>
                      Термины и определения
                    </strong>
                  </p>
                  <p>
                    <strong>Администрация сайта (администрация)</strong> – Общество с ограниченной ответственностью «Айти-Девелопмент Консалтинг» (ОГРН 1201600003516, ИНН 1659205668), адрес: 420059, Россия, Республика Татарстан, г. Казань, ул. Нурсултана Назарбаева, д.35, корп.1, кв.150, адрес электронной почты: help@onelinks.com.
                  </p>
                  <p>
                    <strong>Сайт</strong> – https://www.onelinks.com.
                  </p>
                  <p><strong>Пользователь</strong> – физическое лицо, пользователь сети интернет, акцептировавшее настоящую оферту путем оформления Подписки.
                  </p>
                  <p>
                    <strong>Подписка</strong> – предоставление Пользователю возможности за плату в течение ограниченного промежутка времени получать удаленный доступ к определенному Контенту для просмотра через сеть интернет.
                  </p>
                  <p>
                    <strong>Период подписки</strong> – понимается указанный в Личном кабинете период времени (например, месяц или год), на который оформляется Подписка и установлена соответствующая плата.
                  </p>
                  <p>
                    Период подписки, равный месяцу, начинает течь с даты оплаты Подписки и истекает в соответствующее число календарного месяца, следующего за датой оплаты Подписки.
                  </p>
                  <p>
                    Период подписки, равный году, начинает течь с даты оплаты Подписки и истекает в соответствующие месяц и число календарного года, следующего за датой оплаты Подписки.
                  </p>
                  <p>
                    <strong>Контент</strong> – совокупность аудиовизуальных материалов, размещенных на Сайте, доступ к которым предоставляется в рамках Подписки для просмотра через сеть интернет.
                  </p>
                  <p>
                    <strong>1. Общие положения</strong>
                  </p>
                  <p>
                    1.1. Оформив Подписку, Пользователь считается принявшим условия настоящего Соглашения, а также положения иных документов, которые размещены на Сайте, в полном объеме, без всяких оговорок и исключений. В случае несогласия Пользователя с положениями указанных документов, Пользователь обязан прекратить Подписку в Личном кабинете.
                  </p>
                  <p>
                    1.2. Условия настоящего соглашения, а также документы, размещенные на Сайте, могут быть изменены Администрацией без какого-либо специального уведомления, новая редакция Соглашения, а также иных документов вступают в силу с момента их размещения на Сайте.
                  </p>
                  <p>
                    1.3. В случае если Администрацией были внесены какие-либо изменения в Соглашение и/или иные документы, в порядке, предусмотренном п. 1.2. Соглашения, с которыми Пользователь не согласен, он обязан прекратить Подписку в Личном кабинете. В любом случае совершение Пользователем действий, направленных на получение удаленного доступа к Контенту в рамках Подписки после вступления в силу новой редакции Соглашения и/или иных документов является подтверждением согласия Пользователя с такой новой редакцией.
                  </p>
                  <p>
                    1.4. Оформив Подписку, Пользователь:
                  </p>
                  <p>
                    1.4.1. Подтверждает, что он является дееспособным и достиг возраста, необходимого в соответствии с законодательством Российской Федерации для совершения сделок, предусмотренных Соглашением.
                  </p>
                  <p>
                    1.4.2. Гарантирует достоверность персональной информации, предоставленной при регистрации на Сайте и при оформлении Подписки, принимает на себя всю ответственность за ее точность, полноту и достоверность. Пользователь принимает на себя все возможные риски, связанные с его действиями, совершенными с ошибками или неточностями в предоставленной персональной информации.
                  </p>
                  <p>
                    1.4.3. Подтверждает, что он полностью ознакомился и безоговорочно согласился с Соглашением и иными документами, размещенными на Сайте.
                  </p>
                  <p>
                    1.4.4. Предоставляет свое согласие на получение сообщений рекламного и информационного характера. Пользователь вправе отказаться от получения сообщений рекламного характера следуя инструкциям, указанным в полученном сообщении.
                  </p>
                  <p>
                    <strong>2. Подписка</strong>
                  </p>
                  <p>
                    2.1. Возможность оформить Подписку, а также возможность доступа к Контенту доступна только Пользователю, авторизованному на Сайте в порядке, предусмотренном Пользовательским соглашением.
                  </p>
                  <p>
                    2.2. Для доступа к Контенту в рамках Подписки может потребоваться внесение дополнительной информации в Личном кабинете. Пользователь обязан внести недостающую информацию, либо ему может быть отказано в предоставлении удаленного доступа к соответствующему Контенту в рамках Подписки.
                  </p>
                  <p>
                    2.3. Оформив Подписку, Пользователь заключает с Администрацией на условиях, предусмотренных настоящим документом, а также положениями ст. 429.4 Гражданского кодекса РФ (абонентский договор). По Договору Администрация обязуется предоставить Пользователю удаленный доступ через сеть интернет к Контенту на Период подписки, а Пользователь обязуется оплатить стоимость Подписки.
                  </p>
                  <p>
                    2.4. Размер платы за Подписку, подлежащей перечислению Пользователем, приобретшим Подписку, на счет Администрации, указывается в Личном кабинете. При этом плата взимается за каждый период Подписки, определенный Пользователем при оформлении Подписки.
                  </p>
                  <p>
                    2.5. Внесение платы за Подписку производится Пользователем, приобретающим Подписку, в порядке, предусмотренном настоящим пунктом. В целях оформления Подписки и дальнейшей возможности оплаты Подписки Пользователь, приобретающий Подписку, привязывает свою банковскую карту и/или электронное средство платежа к своему Личному кабинету (Привязанная карта). Для целей настоящего Соглашения любая банковская карта и/или электронное средство платежа, привязанные к Личному кабинету (в том числе привязанные при оформлении Подписки, до её оформления, либо после её оформления) считаются Привязанной картой. Администрация вправе списать сумму, составляющую стоимость Подписки с любой из привязанных карт.
                  </p>
                  <p>
                    Для подтверждения действительности Привязанной карты Администрацией может быть осуществлено списание (блокировка) суммы в пределах 500 рублей (или эквивалентной суммы в валюте страны Пользователя), которая в случае успешного прохождения транзакции возвращается Пользователю, приобретшему Подписку. Неуспешная попытка списания указанной суммы означает невозможность добавления данной Привязанной карты и оформления/оплаты Подписки.
                  </p>
                  <p>
                    При указании данных Привязанной карты и дальнейшем использовании Привязанной карты Пользователь подтверждает и гарантирует указание им достоверной и полной информации о действительной банковской карте, выданной на его имя; соблюдение им правил международных платежных систем и требований банка-эмитента, выпустившего Привязанную карту, в том числе в отношении порядка проведения безналичных расчетов; указание им достоверной и полной информации об электронном платежном средстве; соблюдение требований оператора электронных денег.
                  </p>
                  <p>
                    Администрация оставляет за собой право в любой момент потребовать от Пользователя подтверждения данных, указанных им в Личном кабинете, в том числе данных Привязанной карты, и запросить в связи с этим подтверждающие документы (в частности, документы, удостоверяющие личность), не предоставление которых, по усмотрению Администрации, может быть приравнено к предоставлению недостоверной информации и повлечь последствия, предусмотренные п. 3.1. Соглашения.
                  </p>
                  <p>
                    2.6. Удаленный доступ к Подписке считается предоставленным Пользователю на Период подписки в полном объеме с момента оплаты Пользователем Подписки при условии отражения факта оплаты в Личном кабинете.
                  </p>
                  <p>
                    Обязательства Администрации по предоставлению Пользователю удаленного доступа к Подписке считаются выполненными перед Пользователем независимо от того, было ли затребовано Пользователем соответствующее исполнение от Администрации в Период подписки.
                  </p>
                  <p>
                    2.7. При оформлении Подписки Пользователь, приобретающий Подписку, соглашается с тем, что каждый Период подписки, определенный Пользователем при оформлении Подписки, Администрация вправе в порядке предоплаты взимать установленную им на день оплаты плату за Подписку (абонентскую плату) до момента отказа Пользователя, приобретшего Подписку, от продления Подписки на следующий Период подписки.
                  </p>
                  <p>
                    2.8. Пользователь понимает и соглашается с тем, что Подписка по умолчанию оформляется бессрочно с момента оплаты первого Периода подписки. Пользователь, приобретший Подписку, вправе отказаться от продления Подписки на следующий Период подписки в Личном кабинете. В таком случае Подписка (а именно, удаленный доступ Пользователя к Контенту) прекращается со дня, следующего за последним днем оплаченного Периода подписки. Кроме того, Подписка может быть прекращена Администрацией в иных случаях либо по иным основаниям, предусмотренным Соглашением.
                  </p>
                  <p>
                    2.9. В случае отсутствия достаточной суммы денежных средств на Привязанной карте для продления Подписки, Администрация вправе сохранить возможность доступа Пользователя к Подписке до момента списания абонентской платы с Привязанной карты. Отсутствие достаточной суммы денежных средств на Привязанной карте в течение длительного периода времени, Администрация вправе считать отказом Пользователя от продления Подписки с даты начала неоплаченного Периода подписки.
                  </p>
                  <p>
                    2.10. Пользователь, приобретающий Подписку, принимая условия настоящего Соглашения, даёт своё согласие на автоматическое периодическое списание денежных средств с его счета в оплату Подписки, и признает, что распоряжения на списание денежных средств с его счета, направленные в соответствии с настоящим пунктом Соглашения, являются распоряжениями самого Пользователя, а действия процессингового центра и банка-эквайера, направленные на списание денежных средств в соответствии с настоящим пунктом Соглашения, выполнены с согласия Пользователя.
                  </p>
                  <p>
                    Списание денежных средств в соответствии с настоящим пунктом Соглашения начинает происходить на автоматической основе при соблюдении следующих условий:
                  </p>
                  <p>
                    •	ввода Пользователем всех необходимых реквизитов Привязанной карты;
                  </p>
                  <p>
                    •	активации сервиса по списанию денежных средств на автоматической основе с Привязанной карты следующим способом: автоматически при совершении первого платежа;
                  </p>
                  <p>
                    •	нажатия кнопки «Оформить подписку» (или иной аналогичной по функционалу кнопки), подтверждающего согласие Пользователя с настоящим Соглашением.
                  </p>
                  <p>
                    2.11. Пользователь подтверждает свое согласие с тем, что персональная информация, которую Пользователь предоставляет Администрации при использовании сервисов сайта и в рамках Подписки (в т.ч., при предоставлении доступа к Контенту), в том числе при оформлении и оплате Подписки, может быть передана Администрацией третьим лицам, привлеченным им для исполнения его прав и обязанностей в соответствии с Соглашением. Пользователь соглашается с тем, что Администрация вправе хранить персональную информацию Пользователя не менее трех лет с даты окончания Периода подписки.
                  </p>
                  <p>
                    2.12. Пользователь обязан самостоятельно отслеживать в Личном кабинете информацию о состоянии Подписки (оплаченный Период подписки, стоимость Подписки, перечень доступного Контента, который может изменяться, в т.ч. дополняться/сокращаться), а также отслеживать внесение изменений и дополнений в настоящее Соглашение и иные документы, которые вступают в силу с даты внесения соответствующего изменения в Личном кабинете (если иная дата вступления в силу изменения не указана в Личном кабинете), либо на страницах указанных документов.
                  </p>
                  <p>
                    2.13. Администрация оставляет за собой право по своему собственному усмотрению изменять или удалять любую публикуемую на Сайте информацию, а также любой Контент, приостанавливать, ограничивать или прекращать доступ Пользователя ко всем или к любому из разделов Сайта в любое время по любой причине или без объяснения причин, с предварительным уведомлением или без такового. При этом Стороны соглашаются, что Администрация не отвечает за любой вред, который может быть причинен Пользователю такими действиями.
                  </p>
                  <p>
                    2.14. Пользователь принимает и соглашается с тем, что любое изменение перечня доступного в рамках Подписки Контента не является основанием для отмены Подписки, пересмотра ее стоимости на оплаченный Период подписки или возврата денежных средств за Подписку. Пользователь принимает и соглашается с тем, что, независимо от факта предоставления удаленного доступа к Контенту, некоторый Контент может быть недоступным Пользователю. Указанные обстоятельства не являются основанием для отмены Подписки, пересмотра ее стоимости на оплаченный Период подписки или возврата денежных средств за Подписку.
                  </p>
                  <p>
                    <strong>3. Прочие условия. Ограничения</strong>
                  </p>
                  <p>
                    3.1. Администрация оставляет за собой право на свое усмотрение отказать Пользователю в доступе к Подписке (Контенту) или ограничить доступ Пользователя к Подписке (Контенту) или к определенным функциям Сайта с использованием Личного кабинета или полностью заблокировать учетную запись Пользователя, в том числе, но не ограничиваясь, при обнаружении неполноты предоставленных Пользователем сведений или недостоверных сведений, предоставленных Пользователем, нарушении Пользователем настоящего Соглашения, законодательства Российской Федерации. В случае блокировки учетной записи в связи с предоставлением Пользователем недостоверных сведений о себе, либо в случае нарушения Пользователем настоящих Условий сумма уплаченной Пользователем абонентской платы за текущий Период подписки не подлежит пересчету/возврату.
                  </p>
                  <p>
                    3.2. Яндекс вправе в одностороннем порядке изменять размер абонентской платы за Подписку. При этом Пользователь, оформивший и оплативший Подписку (с автоматическим продлением Подписки) уведомляется о таком изменении не позднее, чем за 3 (три) календарных дня до вступления в силу изменений следующим способом (по выбору Администрации): путем размещения на сайте новой редакции условий Соглашения или путем размещения информации о новом размере абонентской платы в Личном кабинете, в маркетинговых и рекламных материалах, предоставляемых Пользователям по Интернету / телекоммуникационным каналам связи. При этом не подлежит изменению стоимость фактически оплаченного Пользователем Периода подписки на момент внесения соответствующих изменений.
                  </p>
                  <p>
                    3.3. По общему правилу идентификация Пользователя осуществляется по данным его учетной записи на сайте. Администрация вправе использовать для идентификации Пользователя иные данные, в том числе – данные о лице, вносившем плату, в случаях, когда такая идентификация не влечет нарушение прав сторон, прав третьих лиц, либо нарушение действующего законодательства.
                  </p>
                  <p>
                    3.4. Если иное прямо не указано в Личном кабинете, Пользователь не вправе возмездно или безвозмездно передавать свои права и/или обязанности в рамках оформленной Подписки третьим лицам.
                  </p>
                  <p>
                    3.5. Пользователь обязуется не злоупотреблять предоставленным ему удаленным доступом к Контенту в рамках Подписки, в том числе не совершать действия, направленные на использование Контента в интересах третьих лиц.
                  </p>
                  <p>
                    3.6. Пользователь обязуется соблюдать все требования документов, регламентирующих условия использования соответствующих сервисов сайта и предоставления Подписки.
                  </p>
                  <p>
                    3.7. Если Пользователю предоставлен доступ к Подписке без самостоятельного оформления и/или оплаты Подписки, Пользователь, совершая действия, направленные на получение удаленного доступа к Контенту в рамках Подписки, тем самым подтверждает свое согласие с настоящим Соглашением.
                  </p>
                  <p>
                    3.8. Администрация предпримет все разумные меры и осуществит любые целесообразные действия, направленные на поддержание работоспособности сайта, на котором предоставляется удаленный доступ к Контенту. Пользователь при этом осознает возможность возникновения технических неисправностей и сбоев в работе сайта и согласен с тем, что у Администрации отсутствует техническая возможность предсказать их возникновение, уведомить о них Пользователя заблаговременно, либо полностью исключить вероятность их возникновения. Возникновение таких неисправностей или сбоев вне зависимости от причин и последствий не может быть основанием для применения к Администрации мер ответственности.
                  </p>
                  <p>
                    3.9. Все вопросы и претензии, связанные с Соглашением, должны направляться на электронный адрес Администрации, указанный в настоящем Соглашении.
                  </p>
                  <p>
                    3.10. Администрация вправе по своему усмотрению привлекать третьих лиц для целей реализации/выполнения своих прав и обязанностей в соответствии с настоящим Соглашением.
                  </p>
                  <p>
                    3.11. К настоящему Соглашению и всем отношениям, связанным с Подпиской, подлежит применению право Российской Федерации и любые претензии или споры, вытекающие из настоящего Соглашения, должны рассматриваться в суде по месту нахождения Администрации.
                  </p>
                  <p>
                    3.12. В случаях, предусмотренных действующим законодательством, при оплате Пользователем Подписки кассовый чек направляется на адрес электронной почты, указанный Пользователем в Личном кабинете. При этом, при расчетах за Подписку в валюте страны Пользователя стоимость Подписки указывается в чеке в российских рублях по курсу ЦБ на дату совершения расчета.
                  </p>
                </div>
              </v-col>
            </v-row>
          </v-main>
        </div>
      </v-container>
    </v-main>
    <Footer class="justify-center" :content-class="'privacy-footer'"/>
  </v-app>
</template>

<script lang="ts">
import {Component, Vue} from 'vue-property-decorator';
import Footer from '../../components/common/footer/Footer.vue';

@Component({
  components: {Footer}
})
export default class Offer extends Vue {
  mounted(): void {
    window.scroll(0, 0);
  }
}
</script>

<style lang="scss">

</style>
