<template>
  <v-app class="main-view">
    <v-main class="main-view__container pt-4">
      <v-container class="fluid-container" fluid>
        <div class="content-main pt-0 mb-16">
          <v-main>
            <v-row class="d-flex justify-center">
              <v-col class="d-flex flex-column justify-center align-center">
                <div class="px-3 doc-page d-flex flex-column mt-6 font-16">
                  <p class="text-center">
                    <strong>СОГЛАСИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ ФИЗИЧЕСКИХ ЛИЦ</strong> <br>
                    (В соответствии с Федеральным законом от 27.07.2006 г. № 152-ФЗ)
                  </p>
                  <p>
                    Я, Субъект персональных данных, регистрируясь на интерне-сайте https://www.onelinks.com и/или оставляя на нем заявку даю настоящее согласие на обработку своих персональных данных (далее - согласие) Обществу с ограниченной ответственностью «Айти-Девелопмент Консалтинг» (ОГРН 1201600003516, ИНН 1659205668), адрес: 420059, Россия, Республика Татарстан, г. Казань, ул. Нурсултана Назарбаева, д.35, корп.1, кв.150, адрес электронной почты: help@onelinks.com (далее по тексту Оператор).
                  </p>
                  <p>
                    Действуя свободно, своей волей и в своем интересе, а также подтверждая свою дееспособность, я даю согласие, на обработку своих персональных данных в соответствии со следующими условиями:
                  </p>
                  <p>
                    1. Данное согласие дается на обработку персональных данных как без использования средств автоматизации, так и с их использованием.
                  </p>
                  <p>
                    2. Данное согласие дается на обработку следующих персональных данных: фамилия, имя, отчество, адрес места жительства, возраст, номера контактных телефонов, адреса электронной почты, пользовательские данные (сведения о местоположении; тип и версия ОС, тип и версия браузера, источник, откуда перешел на сайт Субъект персональных данных, с какого сайта или по какой рекламе; язык ОС и браузера, ip-адрес и т.п.).
                  </p>
                  <p>
                    3. Персональные данные могут быть общедоступными, а также предоставленными Субъектом персональных данных.
                  </p>
                  <p>
                    4. Цель обработки персональных данных: обработка входящих обращений Субъекта персональных данных к Оператору с целью приобретения товаров, различных услуг и консультирования; аналитики действий Субъекта персональных данных на веб-сайте и функционирования веб-сайта; исполнение Оператором своих обязательств перед Субъектом персональных данных, проведение рекламных и новостных рассылок.
                  </p>
                  <p>
                    5. Основанием для обработки персональных данных является: ст. 24 Конституции Российской Федерации, ст.6 Федерального закона №152-ФЗ «О персональных данных» и настоящее согласие на обработку персональных данных.
                  </p>
                  <p>
                    6. В ходе обработки с персональными данными будут совершены следующие действия: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (распространение, предоставление, доступ), блокирование, удаление, уничтожение.
                  </p>
                  <p>
                    7. Персональные данные обрабатываются до момента отзыва Субъектом персональных данных настоящего согласия.
                  </p>
                  <p>
                    8. Согласие может быть отозвано Субъектом персональных данных или его представителем путем направления письменного заявления Оператору по адресу электронной почты, указанному в настоящем согласии.
                  </p>
                  <p>
                    9. Настоящее согласие действует все время до момента прекращения обработки персональных данных согласно п.8 данного согласия.
                  </p>
                  <p>
                    10. Регистрируясь и/или оставляя заявку на интернет-сайте, Субъект персональных данных подтверждает свое согласие на обработку Оператором своих персональных данных и факт ознакомления с содержанием настоящего согласия и политикой в отношении обработки Оператором персональных данных, размещенных на интернет-сайте, указанном в настоящем согласии.
                  </p>
                </div>
              </v-col>
            </v-row>
          </v-main>
        </div>
      </v-container>
    </v-main>
    <Footer class="justify-center" :content-class="'privacy-footer'"/>
  </v-app>
</template>

<script lang="ts">
import {Component, Vue} from 'vue-property-decorator';
import Footer from '../../components/common/footer/Footer.vue';
@Component({
  components: {Footer}
})
export default class PersonalData extends Vue {
  mounted(): void {
    window.scroll(0, 0);
  }
}
</script>

<style lang="scss">

</style>
