<template>
  <v-app class="main-view">
    <v-main class="main-view__container pt-4 pb-0">
      <v-container class="fluid-container" fluid>
        <div class="content-main pt-0 mb-16">
          <v-main>
            <v-row class="d-flex justify-center">
              <v-col class="d-flex flex-column justify-center align-center">
                <div class="px-3 doc-page d-flex flex-column mt-6 font-16">
                  <p class="text-center">
                    <strong>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</strong> <br>
                    (политика в отношении обработки персональных данных)
                  </p>
                  <p>
                    Настоящий документ определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных в Обществе с ограниченной ответственностью «Айти-Девелопмент Консалтинг» (ОГРН 1201600003516, ИНН 1659205668), адрес: 420059, Россия, Республика Татарстан, г. Казань, ул. Нурсултана Назарбаева, д.35, корп.1, кв.150, адрес электронной почты: help@onelinks.com (далее по тексту Оператор) в отношении обработки персональных данных и реализации требований к защите персональных данных (далее - Политика) в соответствии с требованиями Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных».
                  </p>
                  <p>
                    1. Персональные данные Субъекта персональных данных обрабатывается в соответствии с ФЗ «О персональных данных» № 152-ФЗ.
                  </p>
                  <p>
                    2. Предоставляя свои персональные данные, Субъект персональных данных соглашается на их обработку Оператором, в том числе в целях выполнения обязательств перед Субъектом персональных данных в рамках публичной оферты, продвижения различных товаров и услуг, проведения различных опросов, контроля результатов маркетинговых акций, клиентской поддержки, контроля удовлетворенности Субъекта персональных данных, а также качества услуг, оказываемых Оператором.
                  </p>
                  <p>
                    3. Под обработкой персональных данных понимается любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение) извлечение, использование, передачу (в том числе передачу третьим лицам, не исключая трансграничную передачу, если необходимость в ней возникла в ходе исполнения обязательств), обезличивание, блокирование, удаление, уничтожение персональных данных.
                  </p>
                  <p>
                    4. Оператор имеет право отправлять информационные, в том числе рекламные сообщения, на электронную почту и мобильный телефон Субъекта персональных данных. Субъект персональных данных вправе отказаться от получения рекламной и другой информации без объяснения причин отказа путем информирования Оператора о своём отказе посредством направления соответствующего заявления на электронный адрес Оператора. Сервисные сообщения, информирующие Субъекта персональных данных о сделанной заявке/заказе и этапах обработки таких запросов, отправляются автоматически и не могут быть отклонены Субъектом персональных данных.
                  </p>
                  <p>5. Отзыв согласия на обработку персональных данных может быть осуществлен путем направления Оператору соответствующего заявления на электронный адрес Оператора.</p>
                  <p>
                    6. Оператор вправе использовать технологию «cookies». «Cookies» не содержат конфиденциальную информацию. Субъект персональных данных настоящим дает согласие на сбор, анализ и использование файлов cookies, в том числе третьими лицами для целей формирования статистики и оптимизации рекламных сообщений.
                  </p>
                  <p>
                    7. Оператор получает информацию об ip-адресе посетителя сайта. Данная информация не используется для установления личности посетителя.
                  </p>
                  <p>
                    8. Оператор не несет ответственности за сведения, предоставленные Субъектом персональных данных на сайте в общедоступной форме.
                  </p>
                  <p>
                    9. Оператор вправе осуществлять записи телефонных разговоров с Субъектом персональных данных. При этом Оператор обязуется: предотвращать попытки несанкционированного доступа к информации, полученной в ходе телефонных переговоров, и/или передачу ее третьим лицам, не имеющим непосредственного отношения к исполнению обращений Субъекта персональных данных.
                  </p>
                  <p>
                    10. Оператор не проверяет предоставленную Субъектом персональных данных информацию и не может судить о ее достоверности. Тем не менее Оператор исходит из того, что Субъект персональных данных предоставляет достоверную и достаточную информацию, а также своевременно обновляете ее.
                  </p>
                </div>
              </v-col>
            </v-row>
          </v-main>
        </div>
      </v-container>
    </v-main>
    <Footer class="justify-center" :content-class="'privacy-footer'"/>
  </v-app>
</template>

<script lang="ts">
import {Component, Vue} from 'vue-property-decorator';
import Footer from '../../components/common/footer/Footer.vue';
@Component({
  components: {Footer}
})
export default class PrivacyPolicy extends Vue {
  mounted(): void {
    window.scroll(0, 0);
  }
}
</script>

<style lang="scss">
</style>
