<template>
  <v-app class="main-view">
    <v-main class="main-view__container pt-4">
      <v-container class="fluid-container" fluid>
        <div class="content-main pt-0 mb-16">
          <v-main>
            <v-row class="d-flex justify-center">
              <v-col class="d-flex flex-column justify-center align-center">
                <div class="px-3 doc-page d-flex flex-column mt-6 font-16">
                  <p class="text-center">
                    <strong>Пользовательское соглашение</strong> <br>
                  </p>
                  <p>
                    Ознакомление заинтересованных лиц с данным предложением осуществляется путем размещения действующей версии
                    соглашения на указанном сайте.
                  </p>
                  <p>
                    Внимательно ознакомьтесь с текстом настоящего Соглашения, если Вы не согласны с каким-либо ее пунктом, Вам
                    предлагается воздержаться от каких-либо действий по использованию Сайта.
                  </p>
                  <p>
                    В соответствии с ч.3 ст.438 Гражданского Кодекса Российской Федерации настоящее Соглашение считается принятым
                    и обязательным к исполнению на следующих условиях:
                  </p>
                  <p>
                    <strong>
                      1. Общие положения
                    </strong>
                  </p>
                  <p>
                    1.1. Предметом регулирования настоящего Соглашения являются отношения между администрацией сайта
                    https://www.onelinks.com (далее – Администрация) и Пользователем по поводу использования им указанного Сайта.
                  </p>
                  <p>
                    1.2. По условиям настоящего Соглашения Администрация предоставляет Пользователю с помощью веб-интерфейса и/или
                    мобильного интерфейса и/или приложений для персональных компьютеров и/или мобильных приложений и иных
                    инструментов доступ к Сайту.
                  </p>
                  <p>
                    <strong>
                      2. Порядок регистрации
                    </strong>
                  </p>
                  <p>
                    2.1. Для того чтобы воспользоваться отдельными возможностями Сайта, Пользователю необходимо пройти процедуру
                    регистрации. Регистрация осуществляется путем заполнения регистрационной формы на Сайте.
                  </p>
                  <p>
                    2.2. Начиная использовать Сайт, либо пройдя процедуру регистрации, Пользователь считается принявшим условия
                    настоящего Соглашения в полном объеме, без всяких оговорок и исключений. В случае несогласия Пользователя с
                    какими-либо из положений Соглашения, Пользователь должен прекратить использование Сайта.
                  </p>
                  <p>
                    2.3. Пользователь самостоятельно обеспечивает сохранность и безопасность своих учетных данных, в том числе
                    логина и пароля к Сайту.
                  </p>
                  <p>
                    2.4. Персональная информация Пользователя, содержащаяся в учетной записи Пользователя, хранится и
                    обрабатывается Администрацией в соответствии с условиями Политики конфиденциальности.
                  </p>
                  <p>
                    <strong>3. Права и обязанности Пользователя</strong>
                  </p>
                  <p>
                    3.1. Пользователь вправе использовать Сайт бесплатно, если иное не предусмотрено отдельными сервисами Сайта,
                    при этом Администрация предоставляет Пользователю как лицензиату право использования функциональных
                    (программных) возможностей Сайта на условиях простой (неисключительной) безвозмездной лицензии. Использование
                    дополнительных платных функциональных (программных) возможностей Сайта предоставляются на условиях простой
                    (неисключительной) лицензии в соответствии с дополнительными платными функциональными (программными)
                    возможностями Сайта.
                  </p>
                  <p>
                    <strong>4. Права и обязанности Администрации</strong>
                  </p>
                  <p>
                    4.1. Администрация самостоятельно определяет структуру Сайта, его внешний вид, разрешает или ограничивает
                    доступ Пользователей к его сервисам.
                  </p>
                  <p>
                    4.2. Администрация вправе:
                  </p>
                  <p>
                    4.2.1. В любое время и по своему усмотрению заблокировать/удалить учетную запись Пользователя и/или
                    приостановить, ограничить, прекратить доступ Пользователя к Сайту.
                  </p>
                  <p>
                    4.2.2. Собирать и обрабатывать информацию о Пользователях, в том числе их персональные данные, в порядке и на
                    основаниях, установленных в Политике конфиденциальности, а также осуществлять сбор и обработку обезличенных
                    статистических данных об использовании Сайта.
                  </p>
                  <p>
                    <strong>5. Права на объекты интеллектуальной собственности</strong>
                  </p>
                  <p>
                    5.1. Сайт содержит в себе изображения, тексты, аудиовизуальные произведения, программные коды, товарные знаки
                    и иные объекты интеллектуальной собственности, права на которые принадлежат Администрации и/или иным третьим
                    лицам. Такие объекты интеллектуальной собственности не могут быть использованы Пользователем без получения
                    предварительного согласия Администрации, либо иных правообладателей.
                  </p>
                  <p>
                    <strong>
                      6. Ответственность сторон
                    </strong>
                  </p>
                  <p>
                    6.1. Сайт и все его сервисы предоставляются «как есть», Пользователь использует Сайт на свой собственный риск.
                    Администрация не гарантирует, что использование Сайта будет соответствовать целям и ожиданиям Пользователя.
                    Администрация не гарантирует, что Сайт будет функционировать непрерывно, быстро, надежно и без ошибок.
                  </p>
                  <p>
                    6.2. Пользователь самостоятельно несет ответственность перед третьими лицами за свои действия, связанные с
                    использованием Сайта, в том числе, если такие действия приведут к нарушению прав и законных интересов
                    Пользователя и/или третьих лиц.
                  </p>
                  <p>
                    6.3. Администрация не несет ответственности:
                  </p>
                  <p>
                    - за любые прямые либо косвенные убытки, произошедшие из-за использования либо невозможности использования Сайта.
                  </p>
                  <p>
                    - из-за несанкционированного доступа к учетной записи Пользователя.
                  </p>
                  <p>
                    - за результаты решений Пользователя, в том числе инвестиционных, а также принятых им на основании материалов (информации), размещенных на Сайте.
                  </p>
                  <p>
                    - за неисполнение или ненадлежащее исполнение третьими лицами обязательств по сделкам, заключенным с Пользователем.
                  </p>
                  <p>
                    6.4. Никакая информация, предоставляемая на Сайте, не может рассматриваться в качестве рекомендации и/или одобрения Администрации к заключению каких-либо сделок с третьими лицами.
                  </p>
                  <p>
                    6.5. Статьи, фото, видео и т.п. материалы, размещенные на сайте, носят исключительно обозревательный характер и не являются рекомендацией, советом или призывом Администрации к чему-либо. Администрация убедительно просит Пользователя учитывать все возможные риски при принятии различных решений (в том числе финансовых).
                  </p>
                  <p>
                    <strong>
                      7. Ссылки и контент третьих лиц
                    </strong>
                  </p>
                  <p>
                    7.1. Сайт может содержать ссылки на другие сайты в сети Интернет (сайты третьих лиц). Такие третьи лица, а также их контент не проверяются Администрацией на соответствие каким-либо требованиям (достоверности, полноты, законности и т.п.). Администрация не несет ответственность за любую информацию, материалы, размещенные на сайтах третьих лиц, к которым Пользователь получает доступ с использованием Сайта, в том числе, за любые мнения или утверждения, выраженные на сайтах третьих лиц, рекламу и т.п., а также за доступность таких сайтов или контента и последствия их использования Пользователем.
                  </p>
                  <p>
                    7.2. Ссылка (в любой форме) на любой иной сайт, описание продукта, услуги, любая информацию коммерческого или некоммерческого характера, размещенная на Сайте, не является одобрением или рекомендацией данных продуктов (услуг, деятельности третьих лиц) со стороны Администрации.
                  </p>
                  <p>
                    <strong>8. Изменения и/или дополнения настоящего Соглашения</strong>
                  </p>
                  <p>
                    8.1. Администрация в любое время по своему усмотрению может изменить настоящее Соглашение с уведомлением Пользователя посредством размещения на Сайте новой редакции Соглашения. Измененное Соглашение в новой редакции вступает в силу в день, следующий за днем опубликования таких изменений. Пользователь обязуется самостоятельно проверять настоящее Соглашение на предмет внесенных изменений.
                  </p>
                  <p>
                    8.2. Пользователь вправе отказаться от принятия изменений и дополнений в настоящее Соглашение путем отказа от использования Сайта.
                  </p>
                  <p>
                    8.3. При регистрации и/или каждом посещении Сайта, Пользователь соглашается с условиями Соглашения в редакции, действующей на момент такого использования.
                  </p>
                </div>
              </v-col>
            </v-row>
          </v-main>
        </div>
      </v-container>
    </v-main>
    <Footer class="justify-center" :content-class="'privacy-footer'"/>
  </v-app>
</template>

<script lang="ts">
import {Component, Vue} from 'vue-property-decorator';
import Footer from '../../components/common/footer/Footer.vue';

@Component({
  components: {Footer}
})
export default class TermsOfUse extends Vue {
  mounted(): void {
    window.scroll(0, 0);
  }
}
</script>

<style lang="scss">

</style>
